const how_to_use_data = `
12-20 08:12:53.104 2852 3556 F LOGDOG_ABOUT      : == LogDog是一款运行于浏览器的安全可靠的日志分析工具 ==
12-20 08:12:53.104 2852 3556 I LOGDOG_FEATURES   : ===== 主要特性 =====
12-20 08:12:53.104 2852 3556 D LOGDOG_FEATURES   : - 企业级安全保障：'完全本地'化处理，纯浏览器环境运行，零网络传输，确保敏感信息安全
12-20 08:12:53.104 2852 3556 D LOGDOG_FEATURES   : - 强大的日志着色：支持'多重染色'快速识别关键信息，可配置独立颜色标记，灵活的自定义着色规则
12-20 08:12:53.104 2852 3556 D LOGDOG_FEATURES   : - 全面的格式支持：支持.log、.txt、.zip、.gz、.zst等格式，支持'压缩文件递归解析'，日志'自动排序'
12-20 08:12:53.104 2852 3556 D LOGDOG_FEATURES   : - 专业的分析能力：支持自定义处理函数，高效处理海量日志，'无需安装部署'，即开即用
12-20 08:12:53.104 2852 3556 I LOGDOG_HOW_TO_USE : ===== 打开日志 =====
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - 浏览器中打开 https://logdog.tech (建议收藏)
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - 直接将包含日志的文件、文件夹、压缩包'拖拽'到浏览器页面或从文件浏览器中选择
12-20 08:12:53.104 2852 3556 I LOGDOG_HOW_TO_USE : ===== 分析日志 =====
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - '快速染色'：选中要染色的文本会自动弹出染色面板，点击期望的颜色即可
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - '日志分析'：在搜索框输入需要过滤的内容，原始日志和过滤后的日志将自动分栏显示
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - '标记日志'：识别到关键行后，点击行号进行标记，该行将默认显示在过滤结果中
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - '实用功能'：可创建预过滤器、预染色规则等，将常用的分析步骤保存下来，避免重复操作
12-20 08:12:53.104 2852 3556 I LOGDOG_HOW_TO_USE : ===== 工作区 & 安全声明 =====
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - '本地工作区'：默认模式，所有操作和配置保存在本地
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - '共享工作区'：登录后可建立共享工作区，邀请他人加入，共享预过滤器、预染色规则等配置
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : - '安全声明'：虽然本工具基于浏览器，但不需要也不会将您的日志上传到云端，即任何情况你的日志都不会离开你的计算机
12-20 08:12:53.104 2852 3556 I LOGDOG_HOW_TO_USE : ===== 感谢您的支持，有任何问题均可点击左下角的联系我们 =====
12-20 08:12:53.104 2852 3556 D LOGDOG_HOW_TO_USE : 接下来，点击左侧边栏的'日志示例'试用一下LogDog吧
`.replace(/\'/g, '`');
const blob = new Blob([how_to_use_data], { type: 'text/plain' });

export const howToUseFile = new File([blob], 'sample-data.log', {
    type: 'text/plain',
    lastModified: Date.now(),
});
